# StairsRunCreateAutoLanding Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunCreateAutoLanding Property
ParameterTypeId Class See Also
---
"With Automatic Landing": Create automatic landing
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunCreateAutoLanding { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunCreateAutoLanding As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunCreateAutoLanding {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace